In [1]:
pip install pyspark

Requirement already satisfied: pyspark in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (3.2.1)
Requirement already satisfied: py4j==0.10.9.3 in c:\users\user\appdata\local\programs\python\python39\lib\site-packages (from pyspark) (0.10.9.3)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.1.1; however, version 22.0.3 is available.
You should consider upgrading via the 'c:\users\user\appdata\local\programs\python\python39\python.exe -m pip install --upgrade pip' command.

In [2]:
import pyspark

In [3]:
import pandas as pd
file = pd.read_csv("Height of Male and Female by Country 2022.csv")

In [4]:
file.drop(["Male Height in Ft","Female Height in Ft","Rank"],axis=1,inplace=True)

In [5]:
file.head()

             Country Name  Male Height in Cm  Female Height in Cm
0             Netherlands             183.78               170.36
1              Montenegro             183.30               169.96
2                 Estonia             182.79               168.66
3  Bosnia and Herzegovina             182.47               167.47
4                 Iceland             182.10               168.91

In [3]:
from pyspark.sql import SparkSession

In [4]:
spark=SparkSession.builder.appName('sparkProject').getOrCreate()

In [5]:
spark

In [9]:
df_pyspark=spark.read.option('header','true').csv("Height of Male and Female by Country 2022.csv",inferSchema=True)

In [10]:
df_pyspark.show()

+----+--------------------+-----------------+-------------------+-----------------+-------------------+
|Rank|        Country Name|Male Height in Cm|Female Height in Cm|Male Height in Ft|Female Height in Ft|
+----+--------------------+-----------------+-------------------+-----------------+-------------------+
|   1|         Netherlands|           183.78|             170.36|             6.03|               5.59|
|   2|          Montenegro|            183.3|             169.96|             6.01|               5.58|
|   3|             Estonia|           182.79|             168.66|              6.0|               5.53|
|   4|Bosnia and Herzeg...|           182.47|             167.47|             5.99|               5.49|
|   5|             Iceland|            182.1|             168.91|             5.97|               5.54|
|   6|             Denmark|           181.89|             169.47|             5.97|               5.56|
|   7|      Czech Republic|           181.19|             167.96|             5.94|               5.51|
|   8|              Latvia|           181.17|             168.81|             5.94|               5.54|
|   9|            Slovakia|           181.02|             167.12|             5.94|               5.48|
|  10|            Slovenia|           180.98|              167.2|             5.94|               5.49|
|  11|             Ukraine|           180.98|             166.62|             5.94|               5.47|
|  12|             Croatia|           180.76|              166.8|             5.93|               5.47|
|  13|              Serbia|           180.74|             168.29|             5.93|               5.52|
|  14|           Lithuania|           180.72|             167.63|             5.93|                5.5|
|  15|              Poland|           180.69|             165.78|             5.93|               5.44|
|  16|             Finland|           180.57|             166.48|             5.92|               5.46|
|  17|              Norway|           180.48|             166.45|             5.92|               5.46|
|  18|              Sweden|           180.46|             166.67|             5.92|               5.47|
|  19|             Germany|           180.28|             166.18|             5.91|               5.45|
|  20|            Dominica|           180.15|             166.89|             5.91|               5.48|
+----+--------------------+-----------------+-------------------+-----------------+-------------------+
only showing top 20 rows

In [11]:
df_pyspark.printSchema()

root
 |-- Rank: integer (nullable = true)
 |-- Country Name: string (nullable = true)
 |-- Male Height in Cm: double (nullable = true)
 |-- Female Height in Cm: double (nullable = true)
 |-- Male Height in Ft: double (nullable = true)
 |-- Female Height in Ft: double (nullable = true)

In [12]:
df_pyspark=df_pyspark.drop("Male Height in Ft","Female Height in Ft")

In [13]:
df_pyspark.show()

+----+--------------------+-----------------+-------------------+
|Rank|        Country Name|Male Height in Cm|Female Height in Cm|
+----+--------------------+-----------------+-------------------+
|   1|         Netherlands|           183.78|             170.36|
|   2|          Montenegro|            183.3|             169.96|
|   3|             Estonia|           182.79|             168.66|
|   4|Bosnia and Herzeg...|           182.47|             167.47|
|   5|             Iceland|            182.1|             168.91|
|   6|             Denmark|           181.89|             169.47|
|   7|      Czech Republic|           181.19|             167.96|
|   8|              Latvia|           181.17|             168.81|
|   9|            Slovakia|           181.02|             167.12|
|  10|            Slovenia|           180.98|              167.2|
|  11|             Ukraine|           180.98|             166.62|
|  12|             Croatia|           180.76|              166.8|
|  13|              Serbia|           180.74|             168.29|
|  14|           Lithuania|           180.72|             167.63|
|  15|              Poland|           180.69|             165.78|
|  16|             Finland|           180.57|             166.48|
|  17|              Norway|           180.48|             166.45|
|  18|              Sweden|           180.46|             166.67|
|  19|             Germany|           180.28|             166.18|
|  20|            Dominica|           180.15|             166.89|
+----+--------------------+-----------------+-------------------+
only showing top 20 rows

In [14]:
df_pyspark.na.drop()#deleting null values

DataFrame[Rank: int, Country Name: string, Male Height in Cm: double, Female Height in Cm: double]

In [31]:
df_pyspark.filter(df_pyspark['Rank']>10).select(["Country Name","Male Height in Cm"]).show()

+-------------------+-----------------+
|       Country Name|Male Height in Cm|
+-------------------+-----------------+
|            Ukraine|           180.98|
|            Croatia|           180.76|
|             Serbia|           180.74|
|          Lithuania|           180.72|
|             Poland|           180.69|
|            Finland|           180.57|
|             Norway|           180.48|
|             Sweden|           180.46|
|            Germany|           180.28|
|           Dominica|           180.15|
|            Bermuda|           179.72|
|        Puerto Rico|           179.48|
|             Greece|           179.26|
|            Belgium|           179.09|
|            Ireland|           179.04|
|            Lebanon|           178.96|
|            Andorra|           178.84|
|Antigua and Barbuda|           178.84|
|          Australia|           178.77|
|             Canada|           178.75|
+-------------------+-----------------+
only showing top 20 rows

In [21]:
jobs = spark.read.csv("Salary Dataset.csv",header=True, inferSchema=True)

In [22]:
jobs.head()

Row(Company Name='Mu Sigma', Job Title='Data Scientist', Salaries Reported=105, Location='Bangalore', Salary='₹6,48,573/yr')

In [23]:
jobs.show()

+--------------------+--------------+-----------------+---------+-------------+
|        Company Name|     Job Title|Salaries Reported| Location|       Salary|
+--------------------+--------------+-----------------+---------+-------------+
|            Mu Sigma|Data Scientist|              105|Bangalore| ₹6,48,573/yr|
|                 IBM|Data Scientist|               95|Bangalore|₹11,91,950/yr|
|Tata Consultancy ...|Data Scientist|               66|Bangalore| ₹8,36,874/yr|
|    Impact Analytics|Data Scientist|               40|Bangalore| ₹6,69,578/yr|
|           Accenture|Data Scientist|               32|Bangalore| ₹9,44,110/yr|
|             Infosys|Data Scientist|               30|Bangalore| ₹9,08,764/yr|
|           Capgemini|Data Scientist|               28|Bangalore| ₹9,26,124/yr|
|Cognizant Technol...|Data Scientist|               26|Bangalore| ₹7,36,708/yr|
|Anheuser-Busch InBev|Data Scientist|               25|Bangalore|₹16,46,721/yr|
|             Fractal|Data Scientist|               22|Bangalore|₹13,92,960/yr|
|              Embibe|Data Scientist|               20|Bangalore|₹14,04,773/yr|
|              Amazon|Data Scientist|               19|Bangalore|₹15,07,343/yr|
|              Google|Data Scientist|               19|Bangalore|₹15,58,095/yr|
|            Flipkart|Data Scientist|               18|Bangalore|₹25,57,843/yr|
|             HP Inc.|Data Scientist|               16|Bangalore|₹15,10,081/yr|
|               Wipro|Data Scientist|               15|Bangalore| ₹7,32,821/yr|
|  Ericsson-Worldwide|Data Scientist|               15|Bangalore|₹12,21,750/yr|
|                 MiQ|Data Scientist|               15|Bangalore|₹17,39,484/yr|
|            Deloitte|Data Scientist|               14|Bangalore|₹11,24,939/yr|
|           Microsoft|Data Scientist|               14|Bangalore|₹16,30,396/yr|
+--------------------+--------------+-----------------+---------+-------------+
only showing top 20 rows

In [24]:
jobs.printSchema()

root
 |-- Company Name: string (nullable = true)
 |-- Job Title: string (nullable = true)
 |-- Salaries Reported: integer (nullable = true)
 |-- Location: string (nullable = true)
 |-- Salary: string (nullable = true)

In [68]:
import pyspark.sql.functions as F

df2 = jobs.withColumn(
    'Salary', 
    F.expr("substring(Salary, 1, length(Salary) -3)")
)

In [71]:
df2 = df2.withColumn(
    'Salary', 
    F.expr("substring(Salary, 2, length(Salary) +1)")
)

In [85]:
from pyspark.sql.types import IntegerType
df3 = df2.withColumn("Salary", df2["Salary"].cast(IntegerType()))

In [87]:
df2.show()

+--------------------+--------------+-----------------+---------+---------+
|        Company Name|     Job Title|Salaries Reported| Location|   Salary|
+--------------------+--------------+-----------------+---------+---------+
|            Mu Sigma|Data Scientist|              105|Bangalore| 6,48,573|
|                 IBM|Data Scientist|               95|Bangalore|11,91,950|
|Tata Consultancy ...|Data Scientist|               66|Bangalore| 8,36,874|
|    Impact Analytics|Data Scientist|               40|Bangalore| 6,69,578|
|           Accenture|Data Scientist|               32|Bangalore| 9,44,110|
|             Infosys|Data Scientist|               30|Bangalore| 9,08,764|
|           Capgemini|Data Scientist|               28|Bangalore| 9,26,124|
|Cognizant Technol...|Data Scientist|               26|Bangalore| 7,36,708|
|Anheuser-Busch InBev|Data Scientist|               25|Bangalore|16,46,721|
|             Fractal|Data Scientist|               22|Bangalore|13,92,960|
|              Embibe|Data Scientist|               20|Bangalore|14,04,773|
|              Amazon|Data Scientist|               19|Bangalore|15,07,343|
|              Google|Data Scientist|               19|Bangalore|15,58,095|
|            Flipkart|Data Scientist|               18|Bangalore|25,57,843|
|             HP Inc.|Data Scientist|               16|Bangalore|15,10,081|
|               Wipro|Data Scientist|               15|Bangalore| 7,32,821|
|  Ericsson-Worldwide|Data Scientist|               15|Bangalore|12,21,750|
|                 MiQ|Data Scientist|               15|Bangalore|17,39,484|
|            Deloitte|Data Scientist|               14|Bangalore|11,24,939|
|           Microsoft|Data Scientist|               14|Bangalore|16,30,396|
+--------------------+--------------+-----------------+---------+---------+
only showing top 20 rows

In [33]:
from pyspark.ml.feature import VectorAssembler

In [25]:
jobs.groupBy('Location').sum('Salaries Reported').show()

+---------+----------------------+
| Location|sum(Salaries Reported)|
+---------+----------------------+
|Bangalore|                  4897|
|   Mumbai|                  1581|
|     Pune|                  1684|
|New Delhi|                  2223|
|Hyderabad|                  1668|
+---------+----------------------+

+--------------------+--------------+-----------------+---------+-------------+
|        Company Name|     Job Title|Salaries Reported| Location|       Salary|
+--------------------+--------------+-----------------+---------+-------------+
|            Mu Sigma|Data Scientist|              105|Bangalore| ₹6,48,573/yr|
|                 IBM|Data Scientist|               95|Bangalore|₹11,91,950/yr|
|Tata Consultancy ...|Data Scientist|               66|Bangalore| ₹8,36,874/yr|
|    Impact Analytics|Data Scientist|               40|Bangalore| ₹6,69,578/yr|
|           Accenture|Data Scientist|               32|Bangalore| ₹9,44,110/yr|
|             Infosys|Data Scientist|               30|Bangalore| ₹9,08,764/yr|
|           Capgemini|Data Scientist|               28|Bangalore| ₹9,26,124/yr|
|Cognizant Technol...|Data Scientist|               26|Bangalore| ₹7,36,708/yr|
|Anheuser-Busch InBev|Data Scientist|               25|Bangalore|₹16,46,721/yr|
|             Fractal|Data Scientist|               22|Bangalore|₹13,92,960/yr|
|              Embibe|Data Scientist|               20|Bangalore|₹14,04,773/yr|
|              Amazon|Data Scientist|               19|Bangalore|₹15,07,343/yr|
|              Google|Data Scientist|               19|Bangalore|₹15,58,095/yr|
|            Flipkart|Data Scientist|               18|Bangalore|₹25,57,843/yr|
|             HP Inc.|Data Scientist|               16|Bangalore|₹15,10,081/yr|
|               Wipro|Data Scientist|               15|Bangalore| ₹7,32,821/yr|
|  Ericsson-Worldwide|Data Scientist|               15|Bangalore|₹12,21,750/yr|
|                 MiQ|Data Scientist|               15|Bangalore|₹17,39,484/yr|
|            Deloitte|Data Scientist|               14|Bangalore|₹11,24,939/yr|
|           Microsoft|Data Scientist|               14|Bangalore|₹16,30,396/yr|
+--------------------+--------------+-----------------+---------+-------------+
only showing top 20 rows